# KelvinInterval Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KelvinInterval Property
SymbolTypeId Class See Also
---
Symbol K, indicating unit Kelvin interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KelvinInterval { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KelvinInterval As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KelvinInterval {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace